//KHOA LUONG KLUON7
Script started on Wed 07 May 2014 08:49:41 PM PDT
You are currently using 19% (91.2 MiB) of your 488.3 MiB quota.
]0;kluon7@unix2:code[kluon7@unix2 code]$ gdb list2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.6-34.el6)
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/m/kluon7/private/cmps012b/lab5/code/list2...done.
(gdb) break main
Breakpoint 1 at 0x4005bf: file list2.c, line 14.
(gdb) run foo bar
Starting program: /afs/cats.ucsc.edu/users/m/kluon7/private/cmps012b/lab5/code/list2 foo bar
warning: Skipping deprecated .gdb_index section in /usr/lib/debug/lib64/ld-2.12.so.debug.
Do "set use-deprecated-index-sections on" before the file is read
to use the section anyway.

Breakpoint 1, main (argc=3, argv=0x7fffffffdba8) at list2.c:14
14	   for (int argi = 0; argi < 5; ++argi) {
(gdb) print argc
$1 = 3
(gdb) print argc[Kv
$2 = (char **) 0x7fffffffdba8
(gdb) print argv[0]
$3 = 0x7fffffffde8c "/afs/cats.ucsc.edu/users/m/kluon7/private/cmps012b/lab5/code/list2"
(gdb) print argv[0][1P]1]
$4 = 0x7fffffffdecf "foo"
(gdb) print argv[1][1P]2]
$5 = 0x7fffffffded3 "bar"
(gdb) print argv[2][1P]3]
$6 = 0x0
(gdb) print argv[3][1P]4]
$7 = 0x7fffffffded7 "REMOTEHOST=dhcp-195-200.cruznet.ucsc.edu"
(gdb) print argv[4][1P]5]
$8 = 0x7fffffffdf00 "HOSTNAME=unix2.lt.ucsc.edu"
(gdb) print argv[5][1P]6]
$9 = 0x7fffffffdf1b "SELINUX_ROLE_REQUESTED="
(gdb) quit
A debugging session is active.

	Inferior 1 [process 23500] will be killed.

Quit anyway? (y or n) e y
]0;kluon7@unix2:code[kluon7@unix2 code]$ exit
exit

Script done on Wed 07 May 2014 08:50:23 PM PDT
