//KHOA LUONG KLUON7
Script started on Wed 07 May 2014 08:47:56 PM PDT
You are currently using 19% (91.2 MiB) of your 488.3 MiB quota.
]0;kluon7@unix2:code[kluon7@unix2 code]$ mk list2.c
CSOURCE=err2.c EXECBIN=err2
+ cid + err2.c
+ checksource err2.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 err2.c -o err2 -lm
+ tee err2.c.log
err2.c: In function â€˜mainâ€™:
err2.c:6:14: warning: initialization makes pointer from integer without a cast [enabled by default]
    char *p = 20;
              ^
+ set +x
============================================================
CSOURCE=err.c EXECBIN=err
+ cid + err.c
+ checksource err.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 err.c -o err -lm
+ tee err.c.log
err.c: In function â€˜fooâ€™:
err.c:6:9: warning: unused variable â€˜pâ€™ [-Wunused-variable]
    int *p = &x;
         ^
err.c: In function â€˜barâ€™:
err.c:11:11: warning: â€˜aâ€™ is used uninitialized in this function [-Wuninitialized]
    printf ("%d %p\n", a, p);
           ^
err.c:11:11: warning: â€˜pâ€™ is used uninitialized in this function [-Wuninitialized]
+ set +x
============================================================
CSOURCE=list1.c EXECBIN=list1
+ cid + list1.c
+ checksource list1.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list1.c -o list1 -lm
+ tee list1.c.log
list1.c: In function â€˜mainâ€™:
list1.c:15:7: warning: implicit declaration of function â€˜mallocâ€™ [-Wimplicit-function-declaration]
       node *node = malloc (sizeof (struct node));
       ^
list1.c:15:20: warning: incompatible implicit declaration of built-in function â€˜mallocâ€™ [enabled by default]
       node *node = malloc (sizeof (struct node));
                    ^
list1.c:12:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
+ set +x
============================================================
CSOURCE=list2.c EXECBIN=list2
+ cid + list2.c
+ checksource list2.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list2.c -o list2 -lm
+ tee list2.c.log
list2.c: In function â€˜mainâ€™:
list2.c:12:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
+ set +x
============================================================
CSOURCE=malloc.c EXECBIN=malloc
+ cid + malloc.c
+ checksource malloc.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 malloc.c -o malloc -lm
+ tee malloc.c.log
malloc.c: In function â€˜mainâ€™:
malloc.c:12:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
malloc.c:12:28: warning: unused parameter â€˜argvâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
                            ^
+ set +x
============================================================
CSOURCE=uninit.c EXECBIN=uninit
+ cid + uninit.c
+ checksource uninit.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 uninit.c -o uninit -lm
+ tee uninit.c.log
uninit.c: In function â€˜mainâ€™:
uninit.c:6:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
uninit.c:6:28: warning: unused parameter â€˜argvâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
                            ^
uninit.c:8:11: warning: â€˜pointerâ€™ is used uninitialized in this function [-Wuninitialized]
    printf ("pointer=%p\n", pointer);
           ^
uninit.c:11:11: warning: â€˜fooâ€™ is used uninitialized in this function [-Wuninitialized]
    printf ("foo=%d\n", foo);
           ^
+ set +x
============================================================
]0;kluon7@unix2:code[kluon7@unix2 code]$ valgrind list2 foo bar
==23226== Memcheck, a memory error detector
==23226== Copyright (C) 2002-2012, and GNU GPL'd, by Julian Seward et al.
==23226== Using Valgrind-3.8.1 and LibVEX; rerun with -h for copyright info
==23226== Command: list2 foo bar
==23226== 
0x4c28180->node {word=0x7ff000029->[REMOTEHOST=dhcp-195-200.cruznet.ucsc.edu], link=0x4c28130}
0x4c28130->node {word=(nil)->[(null)], link=0x4c280e0}
0x4c280e0->node {word=0x7ff000025->[bar], link=0x4c28090}
0x4c28090->node {word=0x7ff000021->[foo], link=0x4c28040}
==23226== Conditional jump or move depends on uninitialised value(s)
==23226==    at 0x400682: main (list2.c:21)
==23226== 
==23226== 
==23226== HEAP SUMMARY:
==23226==     in use at exit: 80 bytes in 5 blocks
==23226==   total heap usage: 5 allocs, 0 frees, 80 bytes allocated
==23226== 
==23226== LEAK SUMMARY:
==23226==    definitely lost: 16 bytes in 1 blocks
==23226==    indirectly lost: 64 bytes in 4 blocks
==23226==      possibly lost: 0 bytes in 0 blocks
==23226==    still reachable: 0 bytes in 0 blocks
==23226==         suppressed: 0 bytes in 0 blocks
==23226== Rerun with --leak-check=full to see details of leaked memory
==23226== 
==23226== For counts of detected and suppressed errors, rerun with: -v
==23226== Use --track-origins=yes to see where uninitialised values come from
==23226== ERROR SUMMARY: 1 errors from 1 contexts (suppressed: 6 from 6)
]0;kluon7@unix2:code[kluon7@unix2 code]$ gdb list2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.6-34.el6)
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/m/kluon7/private/cmps012b/lab5/code/list2...done.
(gdb) break 21
Breakpoint 1 at 0x400632: file list2.c, line 21.
(gdb) run foo bar
Starting program: /afs/cats.ucsc.edu/users/m/kluon7/private/cmps012b/lab5/code/list2 foo bar
warning: Skipping deprecated .gdb_index section in /usr/lib/debug/lib64/ld-2.12.so.debug.
Do "set use-deprecated-index-sections on" before the file is read
to use the section anyway.

Breakpoint 1, main (argc=3, argv=0x7fffffffdba8) at list2.c:21
21	   for (node *curr = head; curr->link != NULL; curr = curr->link) {
(gdb) where
#0  main (argc=3, argv=0x7fffffffdba8) at list2.c:21
(gdb) list
16	      assert (node != NULL);
17	      node->word = argv[argi];
18	      node->link = head;
19	      head = node;
20	   }
21	   for (node *curr = head; curr->link != NULL; curr = curr->link) {
22	      printf ("%p->node {word=%p->[%s], link=%p}\n",
23	              curr, curr->word, curr->word, curr->link);
24	   }
25	   return 9;
(gdb) list list2.c:er[K[K23
18	      node->link = head;
19	      head = node;
20	   }
21	   for (node *curr = head; curr->link != NULL; curr = curr->link) {
22	      printf ("%p->node {word=%p->[%s], link=%p}\n",
23	              curr, curr->word, curr->word, curr->link);
24	   }
25	   return 9;
26	}
(gdb) print head
$1 = (node *) 0x601090
(gdb) bt
#0  main (argc=3, argv=0x7fffffffdba8) at list2.c:21
(gdb) print head
$2 = (node *) 0x601090
(gdb) print head*head
$3 = {word = 0x7fffffffded7 "REMOTEHOST=dhcp-195-200.cruznet.ucsc.edu", 
  link = 0x601070}
(gdb) print *(head->)[Kword)
$4 = 82 'R'
(gdb) print head->link->link->link
$5 = (node *) 0x601030
(gdb) print head->link->link->link*head->link->link->link[C[C[C[C[C[C[C[C[C[C[C[C[C(head->link->link->link[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C)
$6 = {word = 0x7fffffffdecf "foo", link = 0x601010}
(gdb) quit
A debugging session is active.

	Inferior 1 [process 23267] will be killed.

Quit anyway? (y or n) y
]0;kluon7@unix2:code[kluon7@unix2 code]$ exit
exit

Script done on Wed 07 May 2014 08:49:29 PM PDT
